Tekla Open API Reference for Tekla Structures 2025
OBB Constructor
Overload List
Name | Description
OBB()
 Initializes a new instance of the OBB class.
OBB(OBB)
 Initializes a new instance of the OBB class.
OBB(Point, Vector[], Double[])
 Initializes a new instance of the OBB class.
OBB(Point, Vector, Vector, Vector, Double, Double, Double)
 Initializes a new instance of the OBB class.
Top
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace